
[ADVENTArmorResearch X2TechTemplate]
DisplayName="Reverse-Engineering"
Summary="Enemy equipment has traditionally been too high of a risk to use. However, Betos and her Skirmishers have contributed their methods to sever any problematic devices or links within the equipment."
CodeName="Deception"
LongDescription="Commander, we have succesfully reverse engineered the equipment brought back from our encounters. Our soldiers can take advantage of the scavenged gear in combat. Additionally, we may catch our enemy off guard with this new armor. I've passed along our findings to Shen in the workshop."
